fabnum/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-20 mar. 14:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gestion de version avec Git</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="remi.griot@efrei.fr" />
<meta name="description" content="Gestion de version avec Git"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Gestion de version avec Git</h1>
<p>
Git est un outil de gestion version. 
</p>

<blockquote>
<p>
Version control systems provide you with three important capabilities:<br />
<b>Reversibility</b>: the ability to back up to a previous state if you discover that some modification you did was a mistake or a bad idea.<br />
<b>Concurrency</b>: the ability to have many people modifying the same collection of files knowing that conflicting modifications can be detected and resolved.<br />
<b>History</b>: the ability to attach historical data to your data, such as explanatory comments about the intention behind each change to it. Even for a programmer working solo, change histories are an important aid to memory; for a multi-person project, they are a vitally important form of communication among developers.<br />
&#x2014; Git manual
</p>
</blockquote>

<div id="outline-container-org1a00e3d" class="outline-2">
<h2 id="org1a00e3d">Configuration</h2>
<div class="outline-text-2" id="text-org1a00e3d">
</div>
<div id="outline-container-org6fb8306" class="outline-3">
<h3 id="org6fb8306">Clone d'un dépot (en ligne -&gt; local)</h3>
<div class="outline-text-3" id="text-org6fb8306">
<div class="org-src-container">
<pre class="src src-sh">git clone https://github.com/InnovationLab-EFREIParis/Stage_1DOF_DroneBench.git
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e93546" class="outline-3">
<h3 id="org8e93546">Initialisation du dépôt (création des fichiers nécessaires à git dans le dossier .git)</h3>
<div class="outline-text-3" id="text-org8e93546">
<div class="org-src-container">
<pre class="src src-sh">git init
</pre>
</div>
<p>
Cette commande créait une suite de fichier dans le dossier caché .git
Notamment le fichier .gitignore permettant de lister les fichiers ignorés par le gestionnaire de version
</p>
</div>
</div>
</div>

<div id="outline-container-org43ec624" class="outline-2">
<h2 id="org43ec624">En local</h2>
<div class="outline-text-2" id="text-org43ec624">
</div>
<div id="outline-container-org77777fd" class="outline-3">
<h3 id="org77777fd">ajout du fichier monfichier.txt à l'index</h3>
<div class="outline-text-3" id="text-org77777fd">
<div class="org-src-container">
<pre class="src src-sh">git add monfichier.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org2616d14" class="outline-3">
<h3 id="org2616d14">ajout de tous les fichiers encore non présents à l'index</h3>
<div class="outline-text-3" id="text-org2616d14">
<div class="org-src-container">
<pre class="src src-sh">git add .
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3c0974" class="outline-3">
<h3 id="orgb3c0974">retire le ficher monfichier.txt de l’index</h3>
<div class="outline-text-3" id="text-orgb3c0974">
<div class="org-src-container">
<pre class="src src-sh">git rm monfichier.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org5476c74" class="outline-3">
<h3 id="org5476c74">Sauvegarde en local de ma version, accompagné d’un message "Version 1"</h3>
<div class="outline-text-3" id="text-org5476c74">
<div class="org-src-container">
<pre class="src src-sh">git commit –m "Version 1"
</pre>
</div>
</div>
</div>
<div id="outline-container-org02211ea" class="outline-3">
<h3 id="org02211ea">Statut de la cohérence entre l’index, le dépôt local, et le dossier de travail</h3>
<div class="outline-text-3" id="text-org02211ea">
<div class="org-src-container">
<pre class="src src-sh">git status
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4936e10" class="outline-2">
<h2 id="org4936e10">Echange entre distant et local</h2>
<div class="outline-text-2" id="text-org4936e10">
</div>
<div id="outline-container-orgae4c757" class="outline-3">
<h3 id="orgae4c757">local vers distant</h3>
<div class="outline-text-3" id="text-orgae4c757">
<p>
Transfert les commit du dépôt local vers le dépôt maitre (en ligne)
</p>
<div class="org-src-container">
<pre class="src src-sh">git push
</pre>
</div>
</div>
</div>

<div id="outline-container-org27d6d20" class="outline-3">
<h3 id="org27d6d20">Distant vers local</h3>
<div class="outline-text-3" id="text-org27d6d20">
<p>
Télécharge en local le dépôt distant
</p>
<div class="org-src-container">
<pre class="src src-sh">git fetch
</pre>
</div>
<p>
liste les différences entre origin (local) et main(distant)
</p>
<div class="org-src-container">
<pre class="src src-sh">git diff origin/main
</pre>
</div>
<p>
du dépôt local vers l'espace de travail
</p>
<div class="org-src-container">
<pre class="src src-sh">git merge
</pre>
</div>

<p>
Reviens à faire fetch suivie d'un merge
</p>
<div class="org-src-container">
<pre class="src src-sh">git pull 
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: remi.griot@efrei.fr</p>
<p class="date">Created: 2022-12-20 mar. 14:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
